---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DesignOptionFailures.ConfusingPadByElementsInMainModel
source: html/984552a0-8a28-28fb-94c2-eab902d8b588.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DesignOptionFailures.ConfusingPadByElementsInMainModel Property

A pad in a design option cannot be hosted by topography in the Main Model [--if you continue it will not be added to the design option set].

## Syntax (C#)
```csharp
public static FailureDefinitionId ConfusingPadByElementsInMainModel { get; }
```